export class Model{
    constructor(){
        this.data = this.createData();
    }

    createData(){
        const data = [
            {
                id: 1,
                title: "Красивые темные фоны смотреть онлайн",
                image1: "images/image1.jpg",
                image2: "images/image2.jpg",
                image3: "images/image3.jpg",   
                description: "Таким образом, реализация намеченного плана развития требует от нас системного анализа всесторонне сбалансированных нововведений! Разнообразный и богатый опыт новая модель организационной деятельности требует определения и уточнения системы масштабного изменения ряда параметров.",
                author: "Лоуджик",
                views: 12,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 2,
                title: "Красивые таыаыы смотреть онлайн",
                image1: "images/image5.jpg",
                image2: "images/image2.jpg",
                image3: "images/image4.jpg",   
                description: "Таким образом, повышение уровня гражданского сознания способствует подготовке и реализации экономической целесообразности принимаемых решений.",
                author: "listen",
                views: 120,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 3,
                title: "КраРыпыыыь онлайн",
                image1: "images/image1.jpg",
                image2: "images/image1.jpg",
                image3: "images/image1.jpg",   
                description: "Не следует, однако, забывать о том, что социально-экономическое развитие требует от нас системного анализа направлений прогрессивного развития. Задача организации, в особенности же дальнейшее развитие различных форм деятельности способствует повышению актуальности соответствующих условий активизации.",
                author: "Лоуджик2",
                views: 56,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 4,
                title: "Красивые тsdsdsd",
                image1: "images/image2.jpg",
                image2: "images/image2.jpg",
                image3: "images/image6.jpg",    
                description: "Практический опыт показывает, что реализация намеченного плана развития влечет за собой процесс внедрения и модернизации существующих финансовых и административных условий! Соображения высшего порядка, а также рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке экономической целесообразности принимаемых решений.",
                author: "silent",
                views: 78,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 5,
                title: "Красивые темные sdsdsdsdн",
                image1: "images/image3.jpg",
                image2: "images/image6.jpg",
                image3: "images/image2.jpg",   
                description: "С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствующей насущным потребностям. Равным образом выбранный нами инновационный путь требует определения и уточнения форм воздействия.",
                author: undefined,
                views: 33,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 6,
                title: "Красивые темные фоны смотреть онлайн",
                image1: "images/image1.jpg",
                image2: "images/image4.jpg",
                image3: "images/image2.jpg",    
                description: "Равным образом начало повседневной работы по формированию позиции позволяет выполнить важнейшие задания по разработке системы обучения кадров, соответствующей насущным потребностям.",
                author: "олл",
                views: 42,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 7,
                title: "Красивые темные фоны смотреть онлайн",
                image1: "images/image1.jpg",
                image2: "images/image5.jpg",
                image3: "images/image3.jpg",  
                description: "Задача организации, в особенности же консультация с профессионалами из IT позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач.",
                author: "Лодужик",
                views: 62,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 8,
                title: "Красивые темные фоны смотреть онлайн",
                image1: "images/image3.jpg",
                image2: "images/image7.jpg",
                image3: "images/image4.jpg",    
                description: "Соображения высшего порядка, а также постоянное информационно-техническое обеспечение нашей деятельности способствует подготовке и реализации соответствующих условий активизации. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности способствует подготовке и реализации дальнейших направлений развитая системы массового участия?",
                author: "enlist",
                views: 18,  
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
            {
                id: 9,
                title: "Красивые темные фоны смотреть онлайн",
                image1: "images/image6.jpg",
                image2: "images/image5.jpg",
                image3: "images/image3.jpg",   
                description: "Равным образом дальнейшее развитие различных форм деятельности обеспечивает широкому кругу специалистов участие в формировании направлений прогрессивного развития? Практический опыт показывает, что курс на социально-ориентированный национальный проект создаёт предпосылки качественно новых шагов для экономической целесообразности принимаемых решений.",
                author: "Лоуд",
                views: 33,
                avatar: "avatar.jpg",
                date: "2 года назад"
            },
        ]
        return data
    }

    getData(){
        return this.data
    }

}